In [9]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\lokes\appdata\local\programs\python\python310\lib\site-packages (9.0.0)

In [15]:
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

In [16]:
conn=mysql.connector.connect(host="localhost",user="root",password="2525",database="college")

In [19]:
engine=create_engine('mysql+mysqlconnector://root:2525@localhost/college')

In [20]:
query='select * from student'

In [22]:
df=pd.read_sql(query,engine)

In [23]:
df

   Id    Name  age
0   1  Lokesh   21
1   2  Kushal   23

insert data from pandas to sql

In [24]:
data=[(3,"sanket",21)]
df_new=pd.DataFrame(data,columns=["id","Name","age"])
df_new

   id    Name  age
0   3  sanket   21

In [25]:
df_new.to_sql("student",engine,if_exists="append",index=False)

1